#include <stdio.h>


// 地址：一个单元1字节， 由16进度编号

/*
	总结：
		指针是用来存放地址的， 地址是唯一标示一块地址空间的。 
		指针的大小在32位平台是4字节， 在64位平台是8个字节。

	指针类型是有什么意义？
		1. 在解引用修改值操作的时候就有区别的。 当int* p; *p能够访问4个字节， 当char* p; *p能够访问1个字节， 当double* p; *p能够访问8个字节;
		2. 指针类型相加时决定指针的步长， char就加一个字节， int就加4个字节;

*/

//int main() {
//	int a = 10;
//	int* p = &a; // 指针是个变量，存放内存单元的地址（编号）
//	printf("%d %p\n", a, p);
//	return 0;
//}

// 指针类型相加时决定指针的步长， char就加一个字节， int就加4个字节;
//int main() {
//	int a = 0x11223344;
//	int* pa = &a;
//	char* pc = &a;
//	printf("%p\n", pa);
//	printf("%p\n", pa+1);
//	printf("%p\n", pc);
//	printf("%p\n", pc+1);
//	return 0;
//}

// 修改数组的值
//int main() {
//	int arr[10] = {0};
//	int* p = arr; //数组名是首元素地址;
//
//	for (int i = 0; i < 10; i++) {
//		*(p + i) = 1;
//	}
//	return 0;
//}

// 野指针
//int main() {
//	// 未初始化
//	int* p;   // 默认不初始化，会放随机值;
//	*p = 20;
//	//printf("%d\n", *p);
//	return 0;
//}

// 野指针：数组越界访问
//int main() {
//	int a[10] = { 0 };
//	int* p = &a;
//	for (int i = 0; i < 12; i++) {
//		/**p = i;
//		p++;*/
//		*p++ = i;  // 由于是后置++， 先将i值赋给*p，再++;
//	}
//	return 0;
//}


//  test执行完成后，a这个地址已经释放了;
//int* test() {
//	int a = 10;
//	return &a;
//}
//
//int main() {
//	int* p = test();
//	printf("%d\n", *p); // a这个地址已经释放了;
//	return 0;
//}

// 如果规避越界:

/*
	1. 指针要初始化
	2. 小心指针越界
	3. 指针没有值的时候，可以先写NULL
	4. 指针使用之前检查有效性
*/

